ðŸš€ DAY 3 (Today): PANDAS + REAL-WORLD DATA

In [1]:
import pandas as pd

data = {
    "hours_studied": [1, 2, 3, 4, 5],
    "exam_score": [50, 55, 65, 70, 80]
}

df = pd.DataFrame(data)
df

   hours_studied  exam_score
0              1          50
1              2          55
2              3          65
3              4          70
4              5          80

In [3]:
df.head()
df.tail()
df.shape
df.columns
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   hours_studied  5 non-null      int64
 1   exam_score     5 non-null      int64
dtypes: int64(2)
memory usage: 212.0 bytes

In [5]:
df['hours_studied']
df[['hours_studied', 'exam_score']]

   hours_studied  exam_score
0              1          50
1              2          55
2              3          65
3              4          70
4              5          80

In [7]:
df['exam_score'] > 60

0    False
1    False
2     True
3     True
4     True
Name: exam_score, dtype: bool

In [27]:
data = {
    "age": [18, 19, 20, None, 22],
    "score": [65, 70, None, 80, 85]
}

df = pd.DataFrame(data)
df

    age  score
0  18.0   65.0
1  19.0   70.0
2  20.0    NaN
3   NaN   80.0
4  22.0   85.0

In [12]:
df.isna()
df.dropna()
df.fillna(df.mean(numeric_only=True))

     age  score
0  18.00   65.0
1  19.00   70.0
2  20.00   75.0
3  19.75   80.0
4  22.00   85.0

In [15]:
X = df["age"].to_numpy()
y = df["score"].to_numpy()

print(X.shape)
print(y.shape)

(5,)
(5,)

In [26]:
import pandas as pd

data = {
    "experience_years": [1, 2, 3, None, 5, 6],
    "salary": [30000, 35000, 40000, 45000, None, 55000]
}

df = pd.DataFrame(data)
df

df.isna()
df.dropna()
new_data = df.fillna(df.mean(numeric_only=True))
new_data

X = new_data["experience_years"].to_numpy()
y = new_data["salary"].to_numpy()

average_salary = y.mean()
print(f"Average Salary: {average_salary}")

new_data["salary"] > average_salary

Average Salary: 41000.0

0    False
1    False
2    False
3     True
4    False
5     True
Name: salary, dtype: bool